[
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
        "category_id": "01",
        "title": "HTML",
        "image_url": "https://play-lh.googleusercontent.com/85WnuKkqDY4gf6tndeL4_Ng5vgRk7PTfmpI4vHMIosyq6XQ7ZGDXNtYG2s0b09kJMw",
        "details": "HTML (HyperText Markup Language) is the most basic building block of the Web. It defines the meaning and structure of web content. Other technologies besides HTML are generally used to describe a web page's appearance/presentation (CSS) or functionality/behavior (JavaScript)."
    },
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
        "category_id": "02",
        "title": "CSS",
        "image_url": "https://cdn.mos.cms.futurecdn.net/Vp9WvV7YKdH4k8sKRePcE8.jpg",
        "details": "CSS (Cascading Style Sheets) is used to style and lay out web pages — for example, to alter the font, color, size, and spacing of your content, split it into multiple columns, or add animations and other decorative features."
    },
    {
        "_id": "f69a695f037cd9484cecaea37ca71011",
        "category_id": "03",
        "title": "JAVASCRIPT",
        "image_url": "https://www.computerhope.com/jargon/j/javascript.png",
        "details": "JavaScript (js) is a light-weight object-oriented programming language which is used by several websites for scripting the webpages. It is an interpreted, full-fledged programming language that enables dynamic interactivity on websites when applied to an HTML document."
    },
    {
        "_id": "f69a695f037cd9484cecaea37ca71012",
        "category_id": "04",
        "title": "PHP",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/PHP-logo.svg/1200px-PHP-logo.svg.png",
        "details": "Learn PHP. PHP is a server scripting language, and a powerful tool for making dynamic and interactive Web pages. PHP is a widely-used, free, and efficient alternative to competitors such as Microsoft's ASP."
    },
    {
        "_id": "11468ed61aee84de492a8b04158a22f9",
        "category_id": "05",
        "title": "MONGO DB",
        "image_url": "https://webimages.mongodb.com/_com_assets/cms/kuzt9r42or1fxvlq2-Meta_Generic.png",
        "details": "MongoDB is a popular NoSQL document-oriented database management system. NoSQL, or “not only SQL”, databases are fast and flexible, scalable, and quick to get started with. They're becoming increasingly popular in the industry, currently MongoDB is used by companies like Google, Verizon, eBay, and many more!"
    },
    {
        "_id": "11468ed61aee84de492a8b04158a22f0",
        "category_id": "06",
        "title": "PYTHON",
        "image_url": "https://cdn.thenewstack.io/media/2021/11/ab06a958-pythonlogo.png",
        "details": "Python is a computer programming language often used to build websites and software, automate tasks, and conduct data analysis. Python is a general-purpose language, meaning it can be used to create a variety of different programs and isn't specialized for any specific problems."
    }
]